{
  "version": "2.4.1",
  "summary": {
    "title": "AppleShop",
    "owner": "Alhtb",
    "description": "AppleShop is an e-commerce platform that specializes in selling Apple products, including iPhones, AirPods, and accessories. The website allows users to browse products, create accounts, place orders, and make secure payments through integrated third-party payment gateways such as PayPal, GCash, and credit/debit cards.\n\nTo ensure a seamless and secure shopping experience, the platform implements user authentication, encrypted transactions, and secure session management. The backend is built using PHP and MySQL, while the frontend utilizes JavaScript, HTML, and CSS to provide a responsive interface for both desktop and mobile users.\n\nGiven the high value of Apple products, the platform is a prime target for cyber threats, including phishing, data breaches, and financial fraud. To mitigate these risks, AppleShop employs SSL/TLS encryption, multi-factor authentication (MFA), input validation, Web Application Firewalls (WAF), and regular security audits.\n\nAdditionally, the platform must comply with data protection regulations, including the Philippine Data Privacy Act (RA 10173) and PCI DSS standards for secure payment processing. The main security objective is to protect user data, prevent unauthorized access, and ensure the integrity of transactions while maintaining high availability and performance.",
    "id": 0
  },
  "detail": {
    "contributors": [],
    "diagrams": [
      {
        "id": 1,
        "title": "AppleShop Threat Model",
        "diagramType": "STRIDE",
        "placeholder": "New STRIDE diagram description",
        "thumbnail": "./public/content/images/thumbnail.stride.jpg",
        "version": "2.4.1",
        "cells": [],
        "description": "Threat Model for AppleShop e-commerce platform, identifying risks to authentication, payment processing, and data security"
      }
    ],
    "diagramTop": 2,
    "reviewer": "",
    "threatTop": 0
  }
}